[
  { "type": "any",          "trait": "Adhesive: You adhere to anything you touch. Any huge or smaller creature adhered to you is also grappled, and ability checks made to escape your grapple have disadvantage."},
  { "type": "any",          "trait": "Aggressive: As a bonus action, you can move up to your speed towards an enemy you can see."},
  { "type": "any",          "trait": "Alarm: When you take damage, all other monsters of the same breed within 240 ft are aware of your pain."},
  { "type": "any",          "trait": "Alien Mind: You have advantage on Wisdom saving throws."},
  { "type": "any",          "trait": "Amorphous: You can move through a space as narrow as 1 inch wide without squeezing."},
  { "type": "any",          "trait": "Arcane Protection: You are resistant to all magical damage."},
  { "type": "any",          "trait": "Aura - Antimagic: Any creature within 10ft of you has disadvantage when casting magical spells."},
  { "type": "any",          "trait": "Aura - Damaging: The space around you is dangerous. Creatures take damage equal to your level when they enter your aura or start their turn within it."},
  { "type": "any",          "trait": "Aura - Disruptive: All enemies within 10 ft of you have disadvantage on saving throws."},
  { "type": "any",          "trait": "Aura - Entangle: The ground in a 10 ft radius around you is difficult terrain. Each creature that starts its turn in that area must succeed on a Strength saving throw or have its speed reduced to 0 until the start of its next turn."},
  { "type": "any",          "trait": "Aura - Stench: The air is putrid around you. Creatures within 10ft of you have disadvantage on attack rolls, unless they also have the Stench trait."},
  { "type": "any",          "trait": "Barbed Hide: At the start of your turn, deal piercing damage equal to your level to any creature that is grappling you."},
  { "type": "any",          "trait": "Blood Frenzy: You have advantage on melee attack rolls against any creature that doesn’t have all its hit points."},
  { "type": "any",          "trait": "Charger: If you moved more than 20ft in a straight line towards your target, make your melee attack roll with advantage. On a hit, you knock your target prone in addition to any other effect."},
  { "type": "any",          "trait": "Constrict: At the start of your turn, deal bludgeoning damage equal to your level to any creature that you are grappling."},
  { "type": "any",          "trait": "Corrosive Body: Any creature that touches you or makes a melee attack against you takes damage equal to your level. Any weapon that hits you takes a permanent and cumulative −1 penalty to damage rolls—the weapon is destroyed if the penalty reaches −5."},
  { "type": "any",          "trait": "Critical Defence: Critical hits made against you count as normal hits unless you are already bloodied."},
  { "type": "any",          "trait": "Critical Fury: Your attacks score a critical hit on a roll of 19-20."},
  { "type": "any",          "trait": "Damage Absorption: Whenever you would take damage of a specific type, you instead regain that many hit points."},
  { "type": "any",          "trait": "Damage Transfer: When you take damage from an attack, you can transfer half of the damage to another creature within 5 ft of you."},
  { "type": "any",          "trait": "Dangerous Body: Any enemy that touches you or hits you with a melee attack while within 5 ft of you takes damage equal to your level."},
  { "type": "any",          "trait": "Disintegration: When you die, your body distintegrates into dust. You leave behind your weapons and anything else you are carrying."},
  { "type": "any",          "trait": "Dragonbreath: You can breathe dragonfire as an attack, or use it to light small fires."},
  { "type": "any",          "trait": "Earth Glide: You can burrow through nonmagical, unworked earth and stone. While doing so, you don’t disturb the material you move through."},
  { "type": "any",          "trait": "Escape: When you would be reduced to 0 hit points outside of your lair, you instead escape and flee to your lair. You remain there, paralysed and resting, until you recover at least 50% of your hit points."},
  { "type": "any",          "trait": "Explosive: When you fall to 0 hit points, your body explodes and deals damage to everyone within 5ft. You can begin detonation on your turn with a bonus action; you explode at the start of your next turn."},
  { "type": "any",          "trait": "False Appearance: When you remain motionless, you are indistinguishable from a piece of the local landscape."},
  { "type": "any",          "trait": "Fey Mind: You have advantage on saving throws against being charmed, and magic can’t put you to sleep."},
  { "type": "any",          "trait": "Flight: You can fly your speed. While flying, you must move your entire movement speed or land—unless you can also hover. Launching into flight provokes opportunity attacks, even if you Disengage."},
  { "type": "any",          "trait": "Flyby: You don’t provoke an opportunity attack when you fly out of an enemy’s reach."},
  { "type": "any",          "trait": "Freedom of Movement: You ignore difficult terrain, and magical effects can’t reduce your speed or cause it to be restrained. You can spend 5 ft of movement to escape from nonmagical restraints or being grappled."},
  { "type": "any",          "trait": "Grappler: You have advantage on attack rolls against any target you have grappled. In addition, when grappling a target, any damage you take from an attack is split 50/50 with your victim."},
  { "type": "any",          "trait": "Hover: You can hover in one spot in the air for 6 second before you need to move."},
  { "type": "any",          "trait": "Immortal: You cannot be killed unless you are reduced to 0 hit points by a specific type of attack. Any other form of attack will reduce you to 1 hit point instead."},
  { "type": "any",          "trait": "Immutable Form: You are immune to any spell or effect that would alter your form."},
  { "type": "any",          "trait": "Impenetrable: You are resistant to all non-magical damage."},
  { "type": "any",          "trait": "Incorporeal: You can pass through any solid non-magical matter and cannot be hit by any non-magical weapon or attack."},
  { "type": "any",          "trait": "Indominable: You are immune to any effects that would alter your mind or will."},
  { "type": "any",          "trait": "Inscrutable: You are immune to any effect that would sense your emotions or read your thoughts, as well as any divination spell that you refuse. Wisdom (Insight) checks made to ascertain your intentions or sincerity have disadvantage."},
  { "type": "any",          "trait": "Invisible: You cannot be seen."},
  { "type": "any",          "trait": "Life Eater: When you deal damage that reduces a creature to 0 hit points, that creature cannot be revived by any means short of a wish spell."},
  { "type": "any",          "trait": "Magic Resistance: You have advantage on saving throws against spells and other magical effects."},
  { "type": "any",          "trait": "Magic Weapons: Your weapon attacks are magical."},
  { "type": "any",          "trait": "Martial Advantage: Once per turn you may deal extra damage equal to your level when you hit a target within 5ft of your allies."},
  { "type": "any",          "trait": "Parry: You can spend your reaction to gain +3 AC against one melee attack that you can see."},
  { "type": "any",          "trait": "Rampage: When you reduce a target to 0 hit points with a melee attack on your turn, you can spend a bonus action to move up to half your speed and attack a different target."},
  { "type": "any",          "trait": "Reckless: At the start of your turn, you can gain advantage on all melee attacks you make for that turn. However, all attacks against you gain advantage until the start of your next turn."},
  { "type": "any",          "trait": "Redirect: When you are within 5ft of an ally, you can redirect any single attack made against you to your ally instead."},
  { "type": "any",          "trait": "Regeneration: You regain hit points at the start of your turn equal to your maximum hit points / 10. This regeneration stops for 1 turn if you are hit by a specific damage type (fire/acid/lightning/etc) or you are reduced to 0 hit points."},
  { "type": "any",          "trait": "Relentless: The first time you fall to 0 hit points after a long rest, you are instead reduced to 1 hit point."},
  { "type": "any",          "trait": "Seige Monster: You deal double damage to objects and structures."},
  { "type": "any",          "trait": "Shadow Stealth: While in dim light or darkness, you can take the Hide action as a bonus action."},
  { "type": "any",          "trait": "Shifty: You can Disengage as a bonus action."},
  { "type": "any",          "trait": "Slippery: You have advantage on ability checks and saving throws made to escape a grapple."},
  { "type": "any",          "trait": "Spider Climb: You can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},
  { "type": "any",          "trait": "Split: When you are bloodied, you split into two smaller copies. Each new copy has hit points equal to half of your remaining hit points, and acts independantly."},
  { "type": "any",          "trait": "Sure-footed: You have advantage on Strength and Dexterity saving throws made against effects that would knock you prone."},
  { "type": "any",          "trait": "Swarm: You can occupy another creature’s space and vice versa. You gain advantage on attacks against any creature that shares your space."},
  { "type": "any",          "trait": "Teamwork: You have advantage on attack rolls when your target is within 5ft of an unrestrained ally."},
  { "type": "any",          "trait": "Uncanny Senses: Unless you are incapacitated, you cannot be surprised."},
  { "type": "any",          "trait": "Undying Fortitude: If damage reduces you to 0 hit points, make a Consititution saving throw with a DC of 5 + the damage taken. On a success, you drop to 1 hit point instead."},
  { "type": "any",          "trait": "Wakeful: You are never caught sleeping."},
  { "type": "any",          "trait": "War Magic: When you use your action to cast a spell, you can make one weapon attack as a bonus action."},
  { "type": "Lurker",       "trait": "Backstab: If you have advantage on your attack, add your level in extra damage."},
  { "type": "Lurker",       "trait": "Camoflague: When you are hidden, enemies cannot spot you with passive perception and they have disadvantage when making active checks to find you."},
  { "type": "Lurker",       "trait": "Cunning Action: You can Dash, Disengage, or Hide as a bonus action."},
  { "type": "Lurker",       "trait": "Guerilla: When you make an attack while hidden, you don’t reveal yourself and can remain in hiding."},
  { "type": "Lurker",       "trait": "Hide in Plain Sight: Attempt to hide when behind even light cover."},
  { "type": "Striker",      "trait": "Bloodfury: When you are bloodied, you become enraged; -2 AC and +2 attack."},
  { "type": "Striker",      "trait": "Cleave: You can attack two adjacent targets that are within reach, dealing full damage to each."},
  { "type": "Striker",      "trait": "Press the Attack: advantage on attack rolls against bloodied targets (under 50% hit points)."},
  { "type": "Striker",      "trait": "Revenge: Deal bonus damage equal to your level against anyone that hurt you in the previous round."},
  { "type": "Striker",      "trait": "Savage Assault: Once per turn, add your level in extra damage to an attack."},
  { "type": "Supporter",    "trait": "Commander: Instead of making an attack roll, you can command an ally to make an attack against a target of your choice (once per round)."},
  { "type": "Supporter",    "trait": "Ferocity: Allies within 10ft of you gain a bonus to damage equal to your level."},
  { "type": "Supporter",    "trait": "Guidance: Allies within 10ft of you have advantage on their attacks rolls."},
  { "type": "Supporter",    "trait": "Protection: Allies within 10ft of you gain +2 AC."},
  { "type": "Supporter",    "trait": "Rallying Cry: Halve your attack damage to remove a condition from an ally."},
  { "type": "Controller",   "trait": "Crippling Strike: Halve your attack damage to reduce your target’s speed to 0ft until the start of your next turn."},
  { "type": "Controller",   "trait": "Distraction: Halve your attack damage to grant advantage to the next attack roll made against the target."},
  { "type": "Controller",   "trait": "Get Into Position: Halve your attack damage to allow an ally to spend their reaction and move up to half their speed (without provoking opportunity attacks from the target)."},
  { "type": "Controller",   "trait": "Knockback: Halve your attack damage to knock the target back up to 15ft."},
  { "type": "Controller",   "trait": "Sidestep: Halve your attack damage to move yourself and your target 5ft in any direction."},
  { "type": "Defender",     "trait": "Don’t Look Away: When you attack a target, you can mark them. A marked target has -2 to any attack roll that doesn’t include you. You can have one active mark at a time, and marks don’t stack."},
  { "type": "Defender",     "trait": "Get Behind Me: Allies within 5ft of you count as being in three-quarters cover."},
  { "type": "Defender",     "trait": "Got Your Back: When standing next to an ally or attacking target, you can spend your reaction to redirect the attack onto yourself."},
  { "type": "Defender",     "trait": "Heavy Defence: Your defence is impenetrable. Gain +2 AC."},
  { "type": "Defender",     "trait": "You Can’t Leave: Targets always provoke opportunity attacks, even if they take the Disengage action before leaving your reach. In addition, when you hit with an opportunity attack, the target’s speed becomes 0 for the rest of the turn."},
  { "type": "Scout",        "trait": "Explorer: You can climb and move across difficult terrain without any movement penalty."},
  { "type": "Scout",        "trait": "Hard to Hit: When you are standing and unrestained, attacks against you have disadvantage unless you are adjacent to two or more enemies."},
  { "type": "Scout",        "trait": "Light-footed: You can Disengage or Dash as a bonus action. When an enemy moves adjacent to you, you can spend your reaction to move away up to half your speed."},
  { "type": "Scout",        "trait": "Pincer Movement: When an ally moves adjacent to an enemy, you can spend your reaction to move up to your speed towards that same enemy."},
  { "type": "Scout",        "trait": "You Can’t Hide: You have advantage when trying to detect hidden enemies. Any enemy that you can see is also visible to your allies."},
  { "type": "Sniper",       "trait": "Hold Still: You have advantage on attack rolls when your target moved less than 10ft during their last turn."},
  { "type": "Sniper",       "trait": "I Can See You: Your ranged attacks ignore half and three-quarters cover."},
  { "type": "Sniper",       "trait": "Next Time: If you miss a target, you have advantage on your next attack against that same target."},
  { "type": "Sniper",       "trait": "Ricochet: If your attack misses, you can spend your reaction to make another attack against a different target of your choice within 15ft of the original target."},
  { "type": "Sniper",       "trait": "Scattershot: When you make a successful attack, you can deal damage equal to your level to everyone within 5ft of your target (once per round)"}
]